# 这是我的第一个markdown文档

## 上边是第一个标题，下边这个就是子标题了

### 这样的话比较好玩

一个#号包着的字体就是一级标题了
两个就是二级标题


怎么设置一个正文呢

正文应该是有那么一点点的粗体文档的  
用来把重要的信息凸显出来

比如 *刘清莲我爱你*

**刘清莲我爱你**

粗体是两个星号

斜体是一个星号

粗斜体是三个星号

```c
int main(void)
{
    printf("刘清莲我爱你");
    printf("哈哈哈哈哈哈")
}
```
输入三个反引号就可以输入代码了。

在三个反引号后边输入编程语言，还能自动高亮

[这个是我的空间](https://user.qzone.qq.com/806204605)

中括号加一个小括号就可以往文档里边添加链接了

中括号里边写链接的名称，然后后边小括号写链接的地址

一级标题还可以在下边加一个等于号就可以
=

二级标题是加减号
-

这也很方便

插入图片也很简单

比插入网址多了一个感叹号

也就感叹号加中括号加一个小括号

比如

![塞尔达](https://ss1.bdstatic.com/70cFvXSh_Q1YnxGkpoWK1HF6hhy/it/u=4061496910,1746197527&fm=26&gp=0.jpg)


就可以了

小括号里边

而且还可以将要显示的文档集中显示

比如

[这是个测试网站，也是百度][网站1]

[网站1]:http://www.baidu.com "鼠标放上去也没什么惊喜"


删除线呢要用波浪线

但是vscode应该显示不出来

总之就是



***
***
三个星号可以弄出来一条线

减号，下划线也可以

---
___


加号可以创建一个无序列表


+ 第一
  + 第二
    + 第三
    + 像这种往加号前边打空格就可以变成二级标题
    + 还是蛮方便的


创建个有序列表还是很爽的

每一列之间的分隔靠管道符号

||

就是上边的那个符号

|姓名| 年龄|在干嘛|
|:-----------:|---:|---:|
|bobo| 20|在写markdown
非常方便可靠|年龄999|在玩


第二行是将表头和底下的表格项分开来用的

默认的话是左对齐，左边加冒号就是左对齐，右边加冒号就是右对齐，两边都加就是居中

方便可靠  
好用

要想换行的话要打两个空格再打回车，才能换行  
直接回车的话是相当于空格的





